:PROPERTIES:
:ID:       20251102T002335
:END:
#+title: AI Tools

* 集成平台

https://dify.ai/

* Aider

** Github Copilot 支持

同事们说用 copilot.el 登录下就能获得 token，然后按 [[https://aider.chat/docs/llms/github.html#where-do-i-get-the-token][官方文档]] 用 OpenAI API 的方式去访问。实际这样用的话会遇到
API 请求被拒绝的情况。

实际 aider 用的 litellm 是支持 copilot 的，用 [[https://www.reddit.com/r/ChatGPTCoding/comments/1lk2mvv/aider_anyone_have_success_with_gh_copilot_oauth/][这里]] 和 [[https://github.com/Aider-AI/aider/issues/2227#issuecomment-3141551921][这里]] 推荐的配置直接就能用了，它自己会去发起申请 token
的流程。

* Emacs

- https://github.com/tninja/aider.el 目前同事推荐的集成交互环境，支持代码分析、生成和 Agent 交互（？）

** gpt.el

gpt.el 的 chat buffer 本身是 markdown/org-mode 格式的。https://github.com/jwiegley/ob-gptel 给 org-mode 增加了
src block 的支持。感觉都很有用。

#+begin_src gptel
What is the capital of France?
#+end_src

#+RESULTS:
: The capital of France is Paris.

* Claude Code

** Copilot models

Can use copilot models with litellm. Somehow models from Open WebUI is not usable, because when switching models
claude specified max_token to be 1 and these models does not know how to responde (I think it's a litellm issue,
the models are not to blame).

https://blog.f12.no/wp/2025/09/22/using-claude-code-with-github-copilot-a-guide/

This comes with it's own quirks, like

#+begin_example
litellm.exceptions.UnsupportedParamsError: litellm.UnsupportedParamsError: github_copilot does not support parameters: [‘thinking’], for model=claude-sonnet-4.5. To drop these, set `litellm.drop_params=True` or for proxy:

`litellm_settings:
drop_params: true`
#+end_example

* OpenCode

Some claims that it uses less tokens than Claude Code (I guess most agents use less tokens than that). It supports Copilot out of
the box. However it seems that it would report errors during normal usage, and when I switch to use `claude-sonnet-4.5` it cannot
show the responses (until I reopen the TUI program and resume the last session).

** 其它
- https://github.com/milanglacier/minuet-ai.el 单纯的代码补全
- https://github.com/xenodium/chatgpt-shell AI 集成交互环境
